Config Used:
```
locals {
  waf_policy = [{
    name                 = "mytestpolicy2"
    server_technologies  = ["MySQL"]
    partition            = "Common"
    template_name        = "POLICY_TEMPLATE_API_SECURITY"
    application_language = "utf-8"
    enforcement_mode     = "blocking"
    description          = "Rapid Deployment-3"
    },
    {
      name                 = "mytestpolicy3"
      server_technologies  = ["MySQL"]
      partition            = "Common"
      template_name        = "POLICY_TEMPLATE_API_SECURITY"
      application_language = "utf-8"
      enforcement_mode     = "blocking"
      description          = "Rapid Deployment-4"
  }]
}

module "bigip_waf_policy" {
  source = "./module"
  for_each = {
    for index, policy in local.waf_policy :
    policy.name => policy
  }
  name                 = each.value.name
  partition            = each.value.partition
  template_name        = each.value.template_name
  application_language = each.value.application_language
  enforcement_mode     = each.value.enforcement_mode
  description          = each.value.description
}
```
```
Terraform will perform the following actions:

  # module.bigip_waf_policy["mytestpolicy2"].bigip_waf_policy.test-awaf-new will be created
  + resource "bigip_waf_policy" "test-awaf-new" {
      + application_language = "utf-8"
      + case_insensitive     = false
      + description          = "Rapid Deployment-3"
      + enable_passivemode   = false
      + enforcement_mode     = "blocking"
      + id                   = (known after apply)
      + name                 = "mytestpolicy2"
      + partition            = "Common"
      + policy_export_json   = (known after apply)
      + policy_id            = (known after apply)
      + template_name        = "POLICY_TEMPLATE_API_SECURITY"
      + type                 = "security"
    }

  # module.bigip_waf_policy["mytestpolicy3"].bigip_waf_policy.test-awaf-new will be created
  + resource "bigip_waf_policy" "test-awaf-new" {
      + application_language = "utf-8"
      + case_insensitive     = false
      + description          = "Rapid Deployment-4"
      + enable_passivemode   = false
      + enforcement_mode     = "blocking"
      + id                   = (known after apply)
      + name                 = "mytestpolicy3"
      + partition            = "Common"
      + policy_export_json   = (known after apply)
      + policy_id            = (known after apply)
      + template_name        = "POLICY_TEMPLATE_API_SECURITY"
      + type                 = "security"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.bigip_waf_policy["mytestpolicy3"].bigip_waf_policy.test-awaf-new: Creating...
module.bigip_waf_policy["mytestpolicy2"].bigip_waf_policy.test-awaf-new: Creating...
module.bigip_waf_policy["mytestpolicy3"].bigip_waf_policy.test-awaf-new: Still creating... [10s elapsed]
module.bigip_waf_policy["mytestpolicy2"].bigip_waf_policy.test-awaf-new: Still creating... [10s elapsed]
module.bigip_waf_policy["mytestpolicy2"].bigip_waf_policy.test-awaf-new: Still creating... [20s elapsed]
module.bigip_waf_policy["mytestpolicy3"].bigip_waf_policy.test-awaf-new: Still creating... [20s elapsed]
module.bigip_waf_policy["mytestpolicy2"].bigip_waf_policy.test-awaf-new: Still creating... [30s elapsed]
module.bigip_waf_policy["mytestpolicy3"].bigip_waf_policy.test-awaf-new: Still creating... [30s elapsed]
module.bigip_waf_policy["mytestpolicy3"].bigip_waf_policy.test-awaf-new: Still creating... [40s elapsed]
module.bigip_waf_policy["mytestpolicy2"].bigip_waf_policy.test-awaf-new: Still creating... [40s elapsed]
module.bigip_waf_policy["mytestpolicy3"].bigip_waf_policy.test-awaf-new: Creation complete after 42s [id=G2Vq3wOk-kBb3af5sTyE_g]
module.bigip_waf_policy["mytestpolicy2"].bigip_waf_policy.test-awaf-new: Still creating... [50s elapsed]
module.bigip_waf_policy["mytestpolicy2"].bigip_waf_policy.test-awaf-new: Still creating... [1m0s elapsed]
module.bigip_waf_policy["mytestpolicy2"].bigip_waf_policy.test-awaf-new: Creation complete after 1m0s [id=8UXIlQDGd0Whv0ZJ3BsqeA]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```